<template>
  
  <div id="Help" class="modal">
    <div class="modal-content">
      <h4>Помощь © ILINOV NIOLAY 2017</h4>
      <p>Для начала работы зайдите под аккаунтом. Существет гостевой аккаунт))</p>
      <p>В программе существе два режима работы: для компьютеров и для мобильныхх устройств.</p>
      <p>Выражается это в разных подходах:</p>
      <p>* Для компьютеров предполагается ипользовать клавиатуру для быстрого набора.</p>
      <p>* Для мобильных устройств предполагается отключать клавиатуру.</p>
      <br>
      <p>Клавиатурные сокращения:</p>
      <p><b>F1</b> - помощь</p>
      <p><b>F2</b> - переменовать список (если выделен список) и  переменовать элемент списка (если выделен элемент списка)</p>
      <p><b>← →</b> - выбор списка. <b>CNTRL + ← →</b> перемещает список.</p>
      <p><b>↓ ↑</b> - выбор элемента в выбраном списке. <b>CNTRL + ↓ ↑</b> переносит элемент списка</p>
      <p><b>INSERT</b> - создание списка (если выделен пункт меню) и создание элементов списка (если выделен список)</p>
      <p><b>CNTRL + INSERT</b> - создание списка (если выделен пункт меню) и создание элементов списка (если выделен список)</p>
      <p><b>DELETE</b> - удаление список (если выделен список) и удаление элемента списка (если выделен элемент списка)</p>
      <p><b>ESC</b> - отмена выбора элемента списка (если выбран элемент списка) и отмена выбора списка (если выбран список)</p>
      <p><b>SPACE</b> - установка отмеченным элемента списка (если выбран элемент списка) и установка отмеченным списка (если выбран список). </p>
      <p><b>p</b> - печать. </p>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'Help',
    data() {
      return {}
    },
    methods: {},
    mounted() {
      $('#Help').modal();
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

</style>